# 3. Вывести на экран числа от -N до N

n = int(input('Задайте число N: '))
for i in range(-n, n+1): print('{} ' .format(i))