# Дано количество секунд. Вывести результат в виде: дни:часы:минуты:секунды

seconds = int(input('Введите количество секунд '))

# day 60*60*24
days = seconds // (60*60*24)
hours = seconds % (60*60*24) // (60*60)
minutes = seconds % (60*60*24) % (60*60) // 60
seconds = seconds % (60*60*24) % (60*60) % 60
print('Результат дни:часы:минуты:секунды {}:{}:{}:{}' .format(days, hours, minutes, seconds))